#p.212
#피보나치 수열 소스코드 (재귀적) - 동적프로그래밍
#한번 계산된 결과를 memoization하기 위한 리스트 초기화(top-down방식은 결과를 memoization한다.)
#예를들어 fibo(3) = 2이면 [0 0 0 2 0 0 ...] 이렇게 d[3] array의 3+1번쨰 위치에 저장해놓음
d = [0] * 100

#피보나치 함수를 재귀함수로 구현(탑다운 다이나믹 프로그래밍)!!!!!!!!!!!!!!!!!!!!!!!!!!!!!큰거에서 작은거로
def fibo(x):

	print('f(',str(x),')')	
	#종료조건 (1 혹은 2일때 1을 반환)
	if x == 1 or x == 2:
		return 1
		
	#이미 계산한 적 있는 문제라면 그대로 반환
	if d[x] != 0:
		return d[x]
		
	#아직 계산하지 않은 문제라면 점화식에 따라서 피보나치 결과 반환
	d[x] = fibo(x-1) + fibo(x-2)
	return d[x]

print(fibo(99))